NDJSec/FALCON/knowledge_base/svd/data/SiliconLabs/Series1/EFM32GG11B/EFM32GG11B820F2048GL152.svd
        <register>
          <name>R5VCTRL</name>
          <description>5V Regulator Control</description>
          <addressOffset>0x0C8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000307</resetMask>
          <fields>
            <field>
              <name>BYPASS</name>
              <description>5V Regulator Bypass</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EM4WUEN</name>
              <description>Enable EM4 Wakeup Due to VBUS Detection</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IMONEN</name>
              <description>Enable the Regulator Current Monitor for Selected Current Path to Either VREGI or VBUS</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INPUTMODE</name>
              <description>5V Input Mode</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>AUTO</name>
                  <description>Regulator input supply switched automatically to the highest voltage of either VBUS or VREGI</description>
                  <value>0x00000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VBUS</name>
                  <description>Force VBUS pin as the regulator input</description>
                  <value>0x00000001</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VREGI</name>
                  <description>Force VREGI pin as the regulator input</description>
                  <value>0x00000002</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>R5VADCCTRL</name>
          <description>5V Regulator Control</description>
          <addressOffset>0x0CC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000F001</resetMask>
          <fields>
            <field>
              <name>ENAMUX</name>
              <description>Enable the 5V Subsystem ADC MUX</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AMUXSEL</name>
              <description>ADC Mux Selection</description>
              <bitOffset>12</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>VBUSDIV10</name>
                  <description>VBUS divided by 10</description>
                  <value>0x00000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VREGIDIV10</name>
                  <description>VREGI divided by 10</description>
                  <value>0x00000001</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VREGODIV6</name>
                  <description>VREGO divided by 6</description>
                  <value>0x00000002</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VREGIIMON</name>
                  <description>VREGI current monitor</description>
                  <value>0x00000003</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VBUSIMON</name>
                  <description>VBUS current monitor</description>
                  <value>0x00000004</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>R5VOUTLEVEL</name>
          <description>5V Regulator Voltage Select</description>
          <addressOffset>0x0D0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000001</resetValue>
          <resetMask>0x0000000F</resetMask>
          <fields>
            <field>
              <name>OUTLEVEL</name>
              <description>5V Regulator Voltage</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>R5VDETCTRL</name>
          <description>5V Detector Enables</description>
          <addressOffset>0x0DC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000007</resetMask>
          <fields>
            <field>
              <name>VREGIDETDIS</name>
              <description>VREGI Detector Disable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>VBUSDETDIS</name>
              <description>VBUS Detector Disable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>VREGODETDIS</name>
              <description>VREGO Detector Disable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DCDCLPEM01CFG</name>
          <description>Configuration Bits for Low Power Mode to Be Applied During EM01, This Field is Only Relevant If LP Mode is Used in EM01</description>
          <addressOffset>0x0EC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000300</resetValue>
          <resetMask>0x0000F300</resetMask>
          <fields>
            <field>
              <name>LPCMPBIASEM01</name>
              <description>LP Mode Comparator Bias Selection for EM01</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>BIAS0</name>
                  <description>Maximum load current less than 75uA.</description>
                  <value>0x00000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BIAS1</name>
                  <description>Maximum load current less than 500uA.</description>
                  <value>0x00000001</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BIAS2</name>
                  <description>Maximum load current less than 2.5mA.</description>
                  <value>0x00000002</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BIAS3</name>
                  <description>Maximum load current less than 10mA.</description>
                  <value>0x00000003</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LPCMPHYSSELEM01</name>
              <description>LP Mode Hysteresis Selection for EM01</description>
              <bitOffset>12</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>R5VSTATUS</name>
          <description>5V Detector Status Register</description>
          <addressOffset>0x0F0</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000020</resetValue>
          <resetMask>0x0000003F</resetMask>
          <fields>
            <field>
              <name>VREGIDET</name>
              <description>VREGI Detected</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>VBUSDET</name>
              <description>USB VBUS Detected</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>VREGODET</name>
              <description>VREGO Detected</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>VBUSGTVREGI</name>
              <description>Output of the Supply Comparator Between VBUS and VREGI</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>LDODROPOUTDET</name>
              <description>Regulator Dropout Detection</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>COLDSTART</name>
              <description>Indicates If the Regulator is Going Through a Cold Start</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>R5VSYNC</name>
          <description>5V Read Status Register</description>
          <addressOffset>0x0F8</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000001</resetMask>
          <fields>
            <field>
              <name>OUTLEVELBUSY</name>
              <description>5V Regulator Voltage Register Transfer Busy</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>EM23PERNORETAINCMD</name>
          <description>Clears Corresponding Bits in EM23PERNORETAINSTATUS Unlocking Access to Peripheral</description>
          <addressOffset>0x100</addressOffset>
          <size>32</size>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x01FFFFFF</resetMask>
          <fields>
            <field>
              <name>ACMP0UNLOCK</name>
              <description>Clears Status Bit of ACMP0 and Unlocks Access to It</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>ACMP1UNLOCK</name>
              <description>Clears Status Bit of ACMP1 and Unlocks Access to It</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>PCNT0UNLOCK</name>
              <description>Clears Status Bit of PCNT0 and Unlocks Access to It</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>PCNT1UNLOCK</name>
              <description>Clears Status Bit of PCNT1 and Unlocks Access to It</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>PCNT2UNLOCK</name>
              <description>Clears Status Bit of PCNT2 and Unlocks Access to It</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>I2C0UNLOCK</name>
              <description>Clears Status Bit of I2C0 and Unlocks Access to It</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>I2C1UNLOCK</name>
              <description>Clears Status Bit of I2C1 and Unlocks Access to It</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>DAC0UNLOCK</name>
              <description>Clears Status Bit of DAC0 and Unlocks Access to It</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>IDAC0UNLOCK</name>
              <description>Clears Status Bit of IDAC0 and Unlocks Access to It</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>ADC0UNLOCK</name>
              <description>Clears Status Bit of ADC0 and Unlocks Access to It</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>LETIMER0UNLOCK</name>
              <description>Clears Status Bit of LETIMER0 and Unlocks Access to It</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>WDOG0UNLOCK</name>
              <description>Clears Status Bit of WDOG0 and Unlocks Access to It</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>WDOG1UNLOCK</name>
              <description>Clears Status Bit of WDOG1 and Unlocks Access to It</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>LESENSE0UNLOCK</name>
              <description>Clears Status Bit of LESENSE0 and Unlocks Access to It</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CSENUNLOCK</name>
              <description>Clears Status Bit of CSEN and Unlocks Access to It</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>LEUART0UNLOCK</name>
              <description>Clears Status Bit of LEUART0 and Unlocks Access to It</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>LEUART1UNLOCK</name>
              <description>Clears Status Bit of LEUART1 and Unlocks Access to It</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>LCDUNLOCK</name>
              <description>Clears Status Bit of LCD and Unlocks Access to It</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>LETIMER1UNLOCK</name>
              <description>Clears Status Bit of LETIMER1 and Unlocks Access to It</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>I2C2UNLOCK</name>
              <description>Clears Status Bit of I2C2 and Unlocks Access to It</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>ADC1UNLOCK</name>
              <description>Clears Status Bit of ADC1 and Unlocks Access to It</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>ACMP2UNLOCK</name>
              <description>Clears Status Bit of ACMP2 and Unlocks Access to It</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>ACMP3UNLOCK</name>
              <description>Clears Status Bit of ACMP3 and Unlocks Access to It</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>RTCUNLOCK</name>
              <description>Clears Status Bit of RTC and Unlocks Access to It</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>USBUNLOCK</name>
              <description>Clears Status Bit of USB and Unlocks Access to It</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
